<?php

//////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////
/////////////////////////////PHP 7.2//////////////////////////////
//////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////

//Новый тип object
//Загрузка расширения по имени
//Разрешена перегрузка абстрактных методов
//Sodium теперь является основным расширением
//Добавлено хеширование пароля с помощью Argon2
//Расширенные типы строк для PDO
//Дополнительная отладочная информация при эмуляции подготавливаемых запросов в PDO
//Поддержка расширенных операций в LDAP
//Информация об адресе в расширение сокетов
//Расширение типа параметра
//Разрешена завершающая запятая для сгруппированных пространств имён
//Поддержка proc_nice() для Windows
//Поддержка порядка байт в pack() и unpack()
//Улучшения в расширении EXIF
//Новый функционал в PCRE
