<?php

//////////////////////////////////////////////////////
///////////КОНФИГУРИРОВАНИЯ СЕССИЙ PHP INI////////////
//////////////////////////////////////////////////////

//Способ хранения сессии
//session.save_handler = files

//Место хранения файлов
//session.save_path	/var/lib/php/session

//Сборка мусора на основе вероятности (отключена)
//session.gc_probability = 0
//session.gc_divisor = 1000
//(GC запускается в 0/1000 = 0% случаев)

//Время жизни сессии = 24 минуты (через 24 минуты простоя сессия устареет)
//session.gc_maxlifetime = 1440

//время жизни cookies = 0 (валидны до закрытия браузера)
//session.cookie_lifetime = 0
